test/tests/timesteppers/foam_adjustable_run_time/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     buoyantFoam;

solver          fluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.04;

adjustTimeStep     yes;

maxCo              2.;         // max Courant number

writeControl    adjustableRunTime;

writeInterval   0.12;

// purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   15;

runTimeModifiable true;

functions
{
    #includeFunc writeObjects(h, rho)
}
